InformationRegisters/СтатусыПредставленийКНаградам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПредставленийКНаградам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПредставленияКНаградам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставленКНаграде</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Награда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НаградыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НаградыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Награда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Награждение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПредставленияКНаградам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПредставленияКНаградам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаградаВручена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПредставлениеКНаграде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПредставлениеКНаграде</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительКадровогоПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательствующийНаОбщемСобрании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДолжностногоЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДолжности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтажРаботыВОтрасли</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПредставленияКНаградам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставитьКНаграде</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Награждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Награждение</Name>
			<BasedOn>
				<xr:Item>Document.ПредставлениеКНаграде</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПроцессыНаграждения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура УстановитьРабочийСтолСпециалистПоНаграждениям(СоставФорм, РабочееМестоУстановлено) Экспорт
	
	Если ДоступенИнтерфейсРабочегоСтолаСпециалистПоНаграждениям() И ПравоДоступа("Просмотр", Метаданные.Отчеты["ОтчетыПоПроцессамНаграждения"]) Тогда
		СоставФорм.ЛеваяКолонка.Добавить("Отчет.ОтчетыПоПроцессамНаграждения.Форма.ФормаДляРабочегоСтола");
		РабочееМестоУстановлено = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПанельНастроекЗарплатаКадры

Процедура ПанельЗарплатаКадрыПрочитатьНастройки(Форма) Экспорт
	
	ИспользоватьПроцессыНаграждения = Константы.ИспользоватьПроцессыНаграждения.Получить();
	Форма.ИспользоватьПроцессыНаграждения = ИспользоватьПроцессыНаграждения;
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаполнитьНастройки(Форма, ПараметрыНастроек) Экспорт
	
	ПараметрыНастроек.ИспользоватьПроцессыНаграждения = Форма.ИспользоватьПроцессыНаграждения;
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаписатьНастройки(Параметры, ПараметрыНастроек) Экспорт
	
	Если ПараметрыНастроек.ИспользоватьПроцессыНаграждения Тогда
		Константы.ИспользоватьПроцессыНаграждения.Установить(Параметры.ИспользоватьПроцессыНаграждения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОпределениеДоступностиДанных

Функция ДоступноИзменениеИспользованияПроцессовНаграждения() Экспорт

	Возврат ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьПроцессыНаграждения);

КонецФункции

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "387cf270-51d2-4aa0-8090-d3d0f3c6b787", Метаданные.Документы.ПредставлениеКНаграде);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "ad7f96f1-3b79-4f86-ad8a-687da645ac2d", Метаданные.Документы.Награждение);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// см. УправлениеПечатьюПереопределяемый.ПриОпределенииНастроекПечати
Процедура ПриОпределенииНастроекПечати(НастройкиПечати) Экспорт
	
	НастройкиПечати.ОбъектыПечати.Добавить(Документы.ПредставлениеКНаграде);
	НастройкиПечати.ОбъектыПечати.Добавить(Документы.Награждение);
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ОтчетыПоПроцессамНаграждения);
	
КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если Не ИспользуютсяПроцессыНаграждения() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.ОтчетыПоПроцессамНаграждения) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Подбор кандидатов к награждению'");
	Команда.Важность           = "Обычное";
	Команда.ТипПараметра       = Новый ОписаниеТипов("СправочникСсылка.Награды");
	Команда.МножественныйВыбор = Ложь;
	Команда.РежимЗаписи        = "Записывать";
	Команда.Менеджер           = "Отчет.ОтчетыПоПроцессамНаграждения";
	Команда.КлючВарианта       = "ПодборКандидатов";
	Команда.ИмяПараметраФормы  = "Награда";
	
КонецПроцедуры

#КонецОбласти

Функция ИспользуютсяПроцессыНаграждения() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьПроцессыНаграждения");
	
КонецФункции

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|Документ.Награждение.Чтение.ГруппыФизическихЛиц
		|Документ.Награждение.Чтение.Организации
		|Документ.Награждение.Изменение.ГруппыФизическихЛиц
		|Документ.Награждение.Изменение.Организации
		|Справочник.НаграждениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.НаграждениеПрисоединенныеФайлы.Чтение.Организации
		|Справочник.НаграждениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.НаграждениеПрисоединенныеФайлы.Изменение.Организации
		|Документ.ПредставлениеКНаграде.Чтение.ГруппыФизическихЛиц
		|Документ.ПредставлениеКНаграде.Чтение.Организации
		|Документ.ПредставлениеКНаграде.Изменение.ГруппыФизическихЛиц
		|Документ.ПредставлениеКНаграде.Изменение.Организации
		|Справочник.ПредставлениеКНаградеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ПредставлениеКНаградеПрисоединенныеФайлы.Чтение.Организации
		|Справочник.ПредставлениеКНаградеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ПредставлениеКНаградеПрисоединенныеФайлы.Изменение.Организации
		|РегистрСведений.СтатусыПредставленийКНаградам.Чтение.ГруппыФизическихЛиц
		|РегистрСведений.СтатусыПредставленийКНаградам.Чтение.Организации
		|";
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.Награждение, Истина);
	Списки.Вставить(Метаданные.Документы.ПредставлениеКНаграде, Истина);

	Списки.Вставить(Метаданные.Справочники.НаграждениеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПредставлениеКНаградеПрисоединенныеФайлы, Истина);

	Списки.Вставить(Метаданные.РегистрыСведений.СтатусыПредставленийКНаградам, Истина);

КонецПроцедуры

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ОписаниеПрофиля = ОписаниеПрофиляПроцессыНаграждения();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

Функция ДоступенИнтерфейсРабочегоСтолаСпециалистПоНаграждениям() Экспорт
	
	Возврат ИспользуютсяПроцессыНаграждения() 
		И РольДоступна(Метаданные.Роли.ИнтерфейсРабочегоСтолаСпециалистПоНаграждениям);
	
КонецФункции

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Награждение", "Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПредставлениеКНаграде", "Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтатусыПредставленийКНаградам", "Период", "КадровыйУчет", "Организация");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОснованиеПриказаПечатнойФормыТ11(ДокументНематериальногоПоощрения, Знач Организация, Знач ФизическиеЛица, Знач Награда) Экспорт
	
	Если Не ОбщегоНазначения.ЭтоДокумент(ДокументНематериальногоПоощрения.Метаданные()) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ТипЗнч(ФизическиеЛица) = Тип("Массив") Тогда
		ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическиеЛица);
	КонецЕсли;
	
	ОписаниеПараметров = РегистрыСведений.СтатусыПредставленийКНаградам.ОписаниеПараметровСтатусыПредставленийКНаградам();
	ОписаниеПараметров.НаДату         = Новый Граница(НачалоДня(ДокументНематериальногоПоощрения.Дата)+2, ВидГраницы.Исключая);
	ОписаниеПараметров.Организация    = Организация;
	ОписаниеПараметров.ФизическоеЛицо = ФизическиеЛица;
	ОписаниеПараметров.Награда        = Награда;
	
	ПредставленияКНаградам = РегистрыСведений.СтатусыПредставленийКНаградам.СтатусыПредставленийКНаградам(ОписаниеПараметров);
	ПредставленияКНаградам.Сортировать("Период УБЫВ");
	
	Основания = Новый Массив;
	
	Для Каждого ФизическоеЛицо Из ФизическиеЛица Цикл
		
		ПредставлениеКНаграде = ПредставленияКНаградам.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если ПредставлениеКНаграде.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПредставлениеКНаграде = ПредставлениеКНаграде[0];
		
		Основания.Добавить(СтрШаблон(НСтр("ru='Представление к награде %1 от %2'"), ПредставлениеКНаграде.НомерДокумента, Формат(ПредставлениеКНаграде.Период,"ДФ='dd.MM.yyyy ""г.""'")));
		
	КонецЦикла;
	
	Возврат СтрСоединить(Основания, СтрШаблон(НСтр("ru=',%1'"), Символы.ПС));
	
КонецФункции

Функция ЭтоДокументНаграждения(Данные) Экспорт
	Возврат ТипЗнч(Данные) = Тип("ДокументСсылка.Награждение");
КонецФункции

Процедура ЗаполнитьДанныеНовогоДокументаНаОснованииНаграждения(ДанныеЗаполнения, ДанныеНовогоДокумента) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Награждение") Тогда
		
		РеквизитыЗаполнения = "Организация,МотивПоощрения";
		ЗаполнитьЗначенияСвойств(ДанныеНовогоДокумента, ДанныеЗаполнения, РеквизитыЗаполнения);
		
		Если ДанныеНовогоДокумента.Свойство("ДатаПолученияДохода") Тогда
			ДанныеНовогоДокумента.ДатаПолученияДохода = ДанныеЗаполнения.Дата;
		КонецЕсли;
		
		Если ДанныеНовогоДокумента.Свойство("Дата") Тогда
			ДанныеНовогоДокумента.Дата = ДанныеЗаполнения.Дата;
		КонецЕсли;
		
		Если ДанныеНовогоДокумента.Свойство("Начисления") Тогда
			Для Каждого ДанныеПретендента Из ДанныеЗаполнения.ПретендентыКНаграждению Цикл
				Если ТипЗнч(ДанныеПретендента.Претендент) = Тип("СправочникСсылка.Сотрудники") Тогда
					СтрокаНачисления = ДанныеНовогоДокумента.Начисления.Добавить();
					СтрокаНачисления.Сотрудник = ДанныеПретендента.Претендент;
					Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
						СтрокаНачисления.Подразделение = ДанныеПретендента.Подразделение;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторПрофиляПроцессыНаграждения()
	Возврат "4c18a552-3f25-440b-b276-696cb9fe699a";
КонецФункции

Функция ОписаниеПрофиляПроцессыНаграждения(ПраваНаИнтерфейс = Ложь)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляПроцессыНаграждения();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление процессами награждения'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеАрхиваФизическихЛиц", 				"ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраНачисленияУдержанияПоказатели");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраПлановыхНачислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхОбОбразованииФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхОТрудовойДеятельности");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудниковРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДисциплинарныхВзысканий",				"ЗарплатаКадрыКорпоративнаяПодсистемы.ДисциплинарныеВзыскания");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДополнительныхСведений",				"СтандартныеПодсистемы.Свойства");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровогоСостоянияРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКлассныхЧиновРангов", "ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПродолжительностиДоговоров");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПрофессийФизическихЛиц",				"ЗарплатаКадрыПриложения.КадровыйУчет.ОбразованияФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСведенийДляРеестраГосслужащих",		"ЗарплатаКадрыКорпоративнаяПодсистемы.РеестрГосслужащих");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСводныхДанныхФизическихЛиц", "ЗарплатаКадрыПриложения.КадровыйУчет.СводныеДанныеФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСемейныхПоложенийФизическихЛиц",		"ЗарплатаКадрыПриложения.КадровыйУчет.СемейныеПоложенияФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСостоянийСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСтатистикиПерсоналаРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеШтатногоРасписания");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИзменениеДополнительныхСведений",			"СтандартныеПодсистемы.Свойства");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовНаграждения",	"ЗарплатаКадрыКорпоративнаяПодсистемы.ПроцессыНаграждения");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНаград",					"ЗарплатаКадрыКорпоративнаяПодсистемы.ПроцессыНаграждения");

	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаКадры", "ЗарплатаКадрыПриложения.ЗарплатаКадрыКомандныйИнтерфейс");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИнтерфейсРабочегоСтолаСпециалистПоНаграждениям");

	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

#Область ПроведениеДокументовНаграждения

Процедура ЗаполнитьДанныеДляПроведенияДокументаНаграждения(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ДанныеДокументаНагражденияПомещеныВМенеджерВременныхТаблиц(Запрос, ДокументСсылка) Тогда
		
		ДобавитьДанныеДляПроведенияНаградыФизическихЛиц(Запрос, ДанныеДляПроведения);
		ДобавитьДанныеДляПроведенияПредставленияКНаградам(Запрос, ДанныеДляПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьНаградыФизическихЛиц(ДокументСсылка) Экспорт
	РегистрыСведений.НаградыФизическихЛиц.ОчиститьНаградыФизическихЛиц(ДокументСсылка);
КонецПроцедуры

Процедура СформироватьДвиженияДокументовНаграждения(ДокументСсылка, Движения, ДанныеДляПроведения) Экспорт
	
	ОчиститьНаградыФизическихЛиц(ДокументСсылка);
	
	Если ДанныеДляПроведения.Свойство("СтатусыПредставленийКНаградам") Тогда
		
		Для каждого СтрокаДанныхДляПроведения Из ДанныеДляПроведения.СтатусыПредставленийКНаградам Цикл
			СтрокаДвижений = Движения.СтатусыПредставленийКНаградам.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДанныхДляПроведения);
		КонецЦикла;
		
		Если Движения.СтатусыПредставленийКНаградам.Количество() > 0 Тогда
			Движения.СтатусыПредставленийКНаградам.Записывать = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеДляПроведения.Свойство("НаградыФизическихЛиц") Тогда
		
		РегистрыСведений.НаградыФизическихЛиц.ЗарегистрироватьНаградыФизическихЛиц(ДанныеДляПроведения.НаградыФизическихЛиц, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияНаградыФизическихЛиц(Запрос, ДанныеДляПроведения)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументРегистратор,
	|	ДанныеДокумента.НаименованиеПервичногоДокумента КАК НаименованиеПриказа,
	|	ДанныеДокумента.НомерПервичногоДокумента КАК НомерПриказа,
	|	ДанныеДокумента.ДатаПервичногоДокумента КАК ДатаПриказа,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Награда КАК Награда,
	|	ДанныеДокумента.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ЕСТЬNULL(НаградыФизическихЛиц.НомерПоПорядку, 0)) + ДанныеДокумента.НомерСтроки КАК НомерПоПорядку
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
	|		ПО ДанныеДокумента.ФизическоеЛицо = НаградыФизическихЛиц.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НаименованиеПервичногоДокумента,
	|	ДанныеДокумента.НомерПервичногоДокумента,
	|	ДанныеДокумента.ДатаПервичногоДокумента,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Награда,
	|	ДанныеДокумента.ФизическоеЛицо,
	|	ДанныеДокумента.НомерСтроки";
	
	ДанныеДокументаДляПроведения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДанныхДляПроведения Из ДанныеДокументаДляПроведения Цикл
		СтрокаДанныхДляПроведения.НомерПриказа = ЗарплатаКадрыОтчеты.НомерНаПечать(СтрокаДанныхДляПроведения.Номер, СтрокаДанныхДляПроведения.НомерПриказа);
		СтрокаДанныхДляПроведения.ДатаПриказа = ЗарплатаКадрыОтчеты.ДатаНаПечать(СтрокаДанныхДляПроведения.Дата, СтрокаДанныхДляПроведения.ДатаПриказа);
		СтрокаДанныхДляПроведения.НаименованиеПриказа = ?(ЗначениеЗаполнено(СтрокаДанныхДляПроведения.НаименованиеПриказа), СтрокаДанныхДляПроведения.НаименованиеПриказа,
															НСтр("ru='Приказ о поощрении сотрудников'"));
	КонецЦикла;

	ДанныеДляПроведения.Вставить("НаградыФизическихЛиц", ДанныеДокументаДляПроведения);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияПредставленияКНаградам(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ), СЕКУНДА, 2) КАК Период,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПервичногоДокумента КАК НомерДокумента,
	|	ДанныеДокумента.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокумента.Награда КАК Награда,
	|	ДанныеДокумента.Статус КАК Статус
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента";
	
	ДанныеДокументаДляПроведения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДанныхДляПроведения Из ДанныеДокументаДляПроведения Цикл
		СтрокаДанныхДляПроведения.НомерДокумента = ЗарплатаКадрыОтчеты.НомерНаПечать(СтрокаДанныхДляПроведения.Номер, СтрокаДанныхДляПроведения.НомерДокумента);
	КонецЦикла;
	
	ДанныеДляПроведения.Вставить("СтатусыПредставленийКНаградам", ДанныеДокументаДляПроведения);
	
КонецПроцедуры

#КонецОбласти

Процедура ДополнитьФормуСправочникаНаграды(Форма, ГруппаРодитель) Экспорт
	
	Если Не ИспользуютсяПроцессыНаграждения() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьПравоРедактирования = ПравоДоступа("Редактирование", Метаданные.Справочники.Награды);
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ФлажокМинимальныйВозраст",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Минимальный возраст'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ФлажокМаксимальныйВозраст",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Максимальный возраст'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ФлажокИнтервалыНаграждения",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Исключать ранее награжденных лиц, если не подошел срок повторного награждения'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ФлажокОграничениеДолжностей",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Ограничивать поиск кандидатов по занимаемой должности'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ФлажокМинимальныеСтажиРаботы",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Исключать лиц, не удовлетворящих ни одному отбору по стажу работы'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ФлажокНаличиеНаград",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Проверять наличие наград'")));
							
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Элементы = Форма.Элементы;
	
	ГруппаСтраницы = Элементы.Добавить("ГруппаТребованияККандидатамСтраницы", Тип("ГруппаФормы"), ГруппаРодитель);
	ГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
	
	ГруппаОсновныеТребования = Элементы.Добавить("ГруппаОсновныеТребованияСтраница", Тип("ГруппаФормы"), ГруппаСтраницы);
	ГруппаОсновныеТребования.Вид = ВидГруппыФормы.Страница;
	ГруппаОсновныеТребования.Заголовок = НСтр("ru='Основные требования'");
	ГруппаОсновныеТребования.Подсказка = НСтр("ru='Основные требования'");
	
	ЭлементФормы = Элементы.Добавить("ПовторноеНаграждениеНеПредусмотрено", Тип("ПолеФормы"), ГруппаОсновныеТребования);
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПутьКДанным = "Объект.ПовторноеНаграждениеНеПредусмотрено";
	ЭлементФормы.Заголовок = НСтр("ru='Исключать кандидатов, уже имеющих данную награду'");
	
	ЭлементФормы = Элементы.Добавить("ОтсутствиеДисциплинарныхВзысканий", Тип("ПолеФормы"), ГруппаОсновныеТребования);
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПутьКДанным = "Объект.ОтсутствиеДисциплинарныхВзысканий";
	ЭлементФормы.Заголовок = НСтр("ru='Исключать кандидатов, имеющих незакрытые дисциплинарные взыскания'");

	ЭлементФормы = Элементы.Добавить("СоблюдатьПоследовательностьНаграждения", Тип("ПолеФормы"), ГруппаОсновныеТребования);
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПутьКДанным = "Объект.СоблюдатьПоследовательностьНаграждения";
	ЭлементФормы.Заголовок = НСтр("ru='Соблюдать последовательность награждения по степени'");
	
	ГруппаТребованияКВозрасту = Элементы.Добавить("ГруппаТребованияКВозрасту", Тип("ГруппаФормы"), ГруппаОсновныеТребования);
	ГруппаТребованияКВозрасту.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТребованияКВозрасту.Заголовок = НСтр("ru='Возраст'");
	ГруппаТребованияКВозрасту.Подсказка = НСтр("ru='Ограничивать поиск кандидатов по возрасту'");
	ГруппаТребованияКВозрасту.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	ЭлементФормы = Элементы.Добавить("ФлажокМинимальныйВозраст", Тип("ПолеФормы"), ГруппаТребованияКВозрасту);
	ЭлементФормы.ПутьКДанным = "ФлажокМинимальныйВозраст";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ТолькоПросмотр = Не ЕстьПравоРедактирования;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаТребованийПодбораКандидатов");
	
	ЭлементФормы = Элементы.Добавить("МинимальныйВозраст", Тип("ПолеФормы"), ГруппаТребованияКВозрасту);
	ЭлементФормы.ПутьКДанным = "Объект.МинимальныйВозраст";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;;
	
	ЭлементФормы = Элементы.Добавить("ФлажокМаксимальныйВозраст", Тип("ПолеФормы"), ГруппаТребованияКВозрасту);
	ЭлементФормы.ПутьКДанным = "ФлажокМаксимальныйВозраст";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ТолькоПросмотр = Не ЕстьПравоРедактирования;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаТребованийПодбораКандидатов");
	
	ЭлементФормы = Элементы.Добавить("МаксимальныйВозраст", Тип("ПолеФормы"), ГруппаТребованияКВозрасту);
	ЭлементФормы.ПутьКДанным = "Объект.МаксимальныйВозраст";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;;
	
	ГруппаМинимальныеСтажи = Элементы.Добавить("ГруппаМинимальныеСтажи", Тип("ГруппаФормы"), ГруппаСтраницы);
	ГруппаМинимальныеСтажи.Вид = ВидГруппыФормы.Страница;
	ГруппаМинимальныеСтажи.Заголовок = НСтр("ru='Отбор по стажу работы'");
	ГруппаМинимальныеСтажи.Подсказка = НСтр("ru = 'Исключать лиц, не удовлетворящих ни одному отбору по стажу работы'");
	
	ЭлементФормы = Элементы.Добавить("ФлажокМинимальныеСтажиРаботы", Тип("ПолеФормы"), ГруппаМинимальныеСтажи);
	ЭлементФормы.ПутьКДанным = "ФлажокМинимальныеСтажиРаботы";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ТолькоПросмотр = Не ЕстьПравоРедактирования;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаТребованийПодбораКандидатов");
	
	ЭлементТаблица = Элементы.Добавить("МинимальныеСтажиРаботы", Тип("ТаблицаФормы"), ГруппаМинимальныеСтажи);
	ЭлементТаблица.ПутьКДанным = "Объект.МинимальныеСтажиРаботы";
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ДобавитьКолонкиТаблицыФормы(Элементы, ЭлементТаблица, Метаданные.Справочники.Награды.ТабличныеЧасти.МинимальныеСтажиРаботы.Реквизиты, Истина);

	ГруппаОграничениеДолжностей = Элементы.Добавить("ГруппаОграничениеДолжностей", Тип("ГруппаФормы"), ГруппаСтраницы);
	ГруппаОграничениеДолжностей.Вид = ВидГруппыФормы.Страница;
	ГруппаОграничениеДолжностей.Заголовок = НСтр("ru='Ограничение должностей'");
	ГруппаОграничениеДолжностей.Подсказка = НСтр("ru='Ограничивать поиск кандидатов по занимаемой должности'");
	
	ЭлементФормы = Элементы.Добавить("ФлажокОграничениеДолжностей", Тип("ПолеФормы"), ГруппаОграничениеДолжностей);
	ЭлементФормы.ПутьКДанным = "ФлажокОграничениеДолжностей";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ТолькоПросмотр = Не ЕстьПравоРедактирования;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаТребованийПодбораКандидатов");
	
	ЭлементТаблица = Элементы.Добавить("ОграничениеДолжностей", Тип("ТаблицаФормы"), ГруппаОграничениеДолжностей);
	ЭлементТаблица.ПутьКДанным = "Объект.ОграничениеДолжностей";
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ДобавитьКолонкиТаблицыФормы(Элементы, ЭлементТаблица, Метаданные.Справочники.Награды.ТабличныеЧасти.ОграничениеДолжностей.Реквизиты, Истина);
	
	ГруппаИнтервалыНаграждения = Элементы.Добавить("ГруппаИнтервалыНаграждения", Тип("ГруппаФормы"), ГруппаСтраницы);
	ГруппаИнтервалыНаграждения.Вид = ВидГруппыФормы.Страница;
	ГруппаИнтервалыНаграждения.Заголовок = НСтр("ru='Интервалы между награждениями'");
	ГруппаИнтервалыНаграждения.Подсказка = НСтр("ru='Исключать ранее награжденных лиц, если не подошел срок повторного награждения'");
	
	ЭлементФормы = Элементы.Добавить("ФлажокИнтервалыНаграждения", Тип("ПолеФормы"), ГруппаИнтервалыНаграждения);
	ЭлементФормы.ПутьКДанным = "ФлажокИнтервалыНаграждения";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ТолькоПросмотр = Не ЕстьПравоРедактирования;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаТребованийПодбораКандидатов");
	
	ЭлементТаблица = Элементы.Добавить("ИнтервалыНаграждения", Тип("ТаблицаФормы"), ГруппаИнтервалыНаграждения);
	ЭлементТаблица.ПутьКДанным = "Объект.ИнтервалыНаграждения";
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ДобавитьКолонкиТаблицыФормы(Элементы, ЭлементТаблица, Метаданные.Справочники.Награды.ТабличныеЧасти.ИнтервалыНаграждения.Реквизиты, Истина);

	ГруппаНаличиеНаград = Элементы.Добавить("ГруппаНаличиеНаград", Тип("ГруппаФормы"), ГруппаСтраницы);
	ГруппаНаличиеНаград.Вид = ВидГруппыФормы.Страница;
	ГруппаНаличиеНаград.Заголовок = НСтр("ru='Наличие наград'");
	ГруппаНаличиеНаград.Подсказка = НСтр("ru='Подбирать кандидатов, имеющих минимум одну из наград'");
	
	ЭлементФормы = Элементы.Добавить("ФлажокНаличиеНаград", Тип("ПолеФормы"), ГруппаНаличиеНаград);
	ЭлементФормы.ПутьКДанным = "ФлажокНаличиеНаград";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ТолькоПросмотр = Не ЕстьПравоРедактирования;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаТребованийПодбораКандидатов");
	
	ЭлементТаблица = Элементы.Добавить("НаличиеНаград", Тип("ТаблицаФормы"), ГруппаНаличиеНаград);
	ЭлементТаблица.ПутьКДанным = "Объект.НаличиеНаград";
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ДобавитьКолонкиТаблицыФормы(Элементы, ЭлементТаблица, Метаданные.Справочники.Награды.ТабличныеЧасти.НаличиеНаград.Реквизиты, Истина);

	УстановитьЗначенияРеквизитовФормыНаград(Форма);

КонецПроцедуры

Процедура ДобавитьКолонкиТаблицыФормы(Элементы, ЭлементТаблица, Знач КолонкиТаблицы, ЭтоДобавлениеРеквизитовОбъекта = Ложь)
	
	Для Каждого Реквизит Из КолонкиТаблицы Цикл
		
		ПолеПолеТаблицы = Элементы.Добавить(СтрШаблон("%1%2", ЭлементТаблица.Имя, Реквизит.Имя), Тип("ПолеФормы"), ЭлементТаблица);
		
		Если ЭтоДобавлениеРеквизитовОбъекта Тогда
			ПолеПолеТаблицы.ПутьКДанным = СтрШаблон("Объект.%1.%2", ЭлементТаблица.Имя, Реквизит.Имя);
		Иначе
			ПолеПолеТаблицы.ПутьКДанным = СтрШаблон("%1.%2", ЭлементТаблица.Имя, Реквизит.Имя);
		КонецЕсли;
		
		ПолеПолеТаблицы.Заголовок = Реквизит.Синоним;
		ПолеПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПолеТаблицы.АвтоОтметкаНезаполненного = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначенияРеквизитовФормыНаград(Форма)
	
	Форма.ФлажокМинимальныйВозраст     = Не Форма.Объект.МинимальныйВозраст = 0;
	Форма.ФлажокМаксимальныйВозраст    = Не Форма.Объект.МаксимальныйВозраст = 0;
	Форма.ФлажокМинимальныеСтажиРаботы = Не Форма.Объект.МинимальныеСтажиРаботы.Количество() = 0;
	Форма.ФлажокОграничениеДолжностей  = Не Форма.Объект.ОграничениеДолжностей.Количество() = 0;
	Форма.ФлажокИнтервалыНаграждения   = Не Форма.Объект.ИнтервалыНаграждения.Количество() = 0;
	Форма.ФлажокНаличиеНаград          = Не Форма.Объект.НаличиеНаград.Количество() = 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МинимальныйВозраст",     "Доступность", Форма.ФлажокМинимальныйВозраст);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МаксимальныйВозраст",    "Доступность", Форма.ФлажокМаксимальныйВозраст);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МинимальныеСтажиРаботы", "Доступность", Форма.ФлажокМинимальныеСтажиРаботы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ОграничениеДолжностей",  "Доступность", Форма.ФлажокОграничениеДолжностей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ИнтервалыНаграждения",   "Доступность", Форма.ФлажокИнтервалыНаграждения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НаличиеНаград",          "Доступность", Форма.ФлажокНаличиеНаград);

КонецПроцедуры

Функция ДанныеДокументаНагражденияПомещеныВМенеджерВременныхТаблиц(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументСсылка.Номер, Истина, Истина));
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Награждение") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Награждение.Ссылка КАК Ссылка,
		|	Награждение.Дата КАК Дата,
		|	Награждение.Номер КАК Номер,
		|	Награждение.Организация КАК Организация,
		|	Награждение.НаименованиеПервичногоДокумента КАК НаименованиеПервичногоДокумента,
		|	Награждение.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
		|	Награждение.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
		|	НаграждениеПретенденты.Награда КАК Награда,
		|	НаграждениеПретенденты.Претендент КАК Претендент,
		|	НаграждениеПретенденты.Подразделение КАК Подразделение,
		|	НаграждениеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыПредставленияКНаградам.НаградаВручена) КАК Статус,
		|	НаграждениеПретенденты.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	Документ.Награждение КАК Награждение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Награждение.ПретендентыКНаграждению КАК НаграждениеПретенденты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Награждение.ФизическиеЛица КАК НаграждениеФизическиеЛица
		|			ПО НаграждениеПретенденты.Ссылка = НаграждениеФизическиеЛица.Ссылка
		|				И (ВЫРАЗИТЬ(НаграждениеПретенденты.Претендент КАК Справочник.Сотрудники).ФизическоеЛицо = НаграждениеФизическиеЛица.ФизическоеЛицо
		|					ИЛИ НаграждениеПретенденты.Претендент = НаграждениеФизическиеЛица.ФизическоеЛицо)
		|		ПО Награждение.Ссылка = НаграждениеПретенденты.Ссылка
		|ГДЕ
		|	Награждение.Ссылка = &Ссылка
		|	И НЕ НаграждениеПретенденты.Награда = ЗНАЧЕНИЕ(Справочник.Награды.ПустаяСсылка)";
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Возврат Истина;

КонецФункции

Процедура ПереопределитьТекстЗапросаДляПечатиТ11(СхемаКомпоновкиДанных) Экспорт
	
	Если Не ПроцессыНагражденияВызовСервера.ИспользуютсяПроцессыНаграждения() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ПакетЗапросовСхемыЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	
	Для Каждого ОператорСхемыЗапроса Из ПакетЗапросовСхемыЗапроса.Операторы Цикл
		
		Для Каждого ИсточникСхемыЗапроса Из ОператорСхемыЗапроса.Источники Цикл
			Если ИсточникСхемыЗапроса.Источник.ИмяТаблицы = "Документ.Награждение" Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ОператорСхемыЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы.Добавить();
	ОператорСхемыЗапроса.ТипОбъединения = ТипОбъединенияСхемыЗапроса.Объединить;
	
	ИсточникСхемыЗапросаНаграждения = ОператорСхемыЗапроса.Источники.Добавить("Документ.Награждение", "Награждение");
	ИсточникСхемыЗапросаНаграждения.Соединения.Очистить();
	ИсточникСхемыЗапросаСотрудники = ОператорСхемыЗапроса.Источники.Добавить("Документ.Награждение.ПретендентыКНаграждению", "НаграждениеСотрудники");
	ИсточникСхемыЗапросаСотрудники.Соединения.Очистить();
	ИсточникСхемыЗапросаНаграждения.Соединения.Добавить(ИсточникСхемыЗапросаСотрудники, "Награждение.Ссылка = НаграждениеСотрудники.Ссылка");
	ИсточникСхемыЗапросаНаграждения.Соединения[ИсточникСхемыЗапросаНаграждения.Соединения.Количество()-1].ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
	ИсточникСхемыЗапросаНаграждения.Соединения[ИсточникСхемыЗапросаНаграждения.Соединения.Количество()-1].ОбязательноеСоединение = Истина;
	
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("НаграждениеСотрудники.Ссылка", 0);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("ВЫБОР
												|	КОГДА Награждение.ДатаПервичногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
												|		ТОГДА Награждение.Дата
												|	ИНАЧЕ Награждение.ДатаПервичногоДокумента
												|КОНЕЦ", 1);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("НаграждениеСотрудники.Претендент", 2);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("НаграждениеСотрудники.Подразделение", 3);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("НаграждениеСотрудники.НомерСтроки", 4);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("0", 5);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("НаграждениеСотрудники.Награда", 6);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("NULL", 7);
	ОператорСхемыЗапроса.ВыбираемыеПоля.Добавить("NULL", 8);
	
	ОператорСхемыЗапроса.Отбор.Добавить(Новый ВыражениеСхемыЗапроса("Награждение.Ссылка В(&СсылкиНаОбъекты)"));
	ОператорСхемыЗапроса.Отбор.Добавить(Новый ВыражениеСхемыЗапроса("НаграждениеСотрудники.Претендент ССЫЛКА Справочник.Сотрудники"));
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецПроцедуры

#КонецОбласти
